#8.1 bayes判别和Fisher判别
#
# 天气预报：明天是否下雨
# 两个自变量：今天和昨天的温度差X1,今天的压温差X2
# 如果x=8.1,x2=2.0,问明天十分下雨？
#方法：距离判别和Bayes判别（方差相同和方差不同两种情况）和Fisher判别
setwd('E:/dataguru/RDataAna/week12')#设定当前的工作目录

classX1<-data.frame(
    x1=c(-1.9,-6.9,5.2,5.0,7.3,6.8,0.9,-12.5,1.5,3.8),
    x2=c(3.2,10.4,2.0,2.5,0.0,12.7,-15.4,-2.5,1.3,6.8)
)
classX2<-data.frame(
    x1=c(0.2,-0.1,0.4,2.7,2.1,-4.6,-1.7,-2.6,2.6,-2.8),
    x2=c(0.2,7.5,14.6,8.3,0.8,4.3,10.9,13.1,12.8,10.0)
)

#距离判别法
source("discriminiant.distance.R")
discriminiant.distance(classX1, classX2, var.equal=TRUE) #方差相同
	      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
	blong 1 2 1 1 1 2 1 1 1  1  1  2  2  2  1  2  2  2  2  2
discriminiant.distance(classX1, classX2) #方差不同
	      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
	blong 1 1 1 1 1 1 1 1 1  1  1  2  2  1  1  1  2  2  1  2

#贝叶斯分类器
source("discriminiant.bayes.R")

#### 样本协方差相同
discriminiant.bayes(classX1, classX2, rate=1, var.equal=TRUE)
	      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
	blong 1 2 1 1 1 2 1 1 1  1  1  2  2  2  1  2  2  2  2  2
#### 样本协方差不同
discriminiant.bayes(classX1, classX2, rate=1)
      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
blong 2 1 1 1 1 1 1 1 2  2  2  2  2  2  1  1  2  2  2  2

#Fisher判别
#Fisher判别是按类内方差尽量小，类间方差尽量大的准则来求判别函数的，在这里讨论两个总体的判别方法
source("discriminiant.fisher.R")
discriminiant.fisher(classX1, classX2)
	      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20
	blong 1 2 1 1 1 2 1 1 1  1  1  2  2  2  1  2  2  2  2  2

#8.2 心电图指标对健康人（I）、硬化症患者（II)和冠心病患者（III）的鉴别能力，现获得训练样本，
#请距离判别和Bayes判别对数据进行分析
# 先验概率分别为11/23,7/23,5/23

TrnX<-data.frame(x1=c(8.11,9.36,9.85,2.55,6.01,9.64,4.11,8.9,7.71,7.51,8.06,
                   6.8,8.68,5.67,8.1,3.71,5.37,9.89,
                   5.22,4.71,4.71,3.36,8.27),
              x2=c(261.01,185.39,249.58,137.13,231.34,231.38,260.25,259.91,273.84,303.59,231.03,
                   308.9,258.69,355.54,476.69,316.32,274.57,409.42,
                   330.34,331.47,352.5,347.31,189.56),
              x3=c(13.23,9.02,15.6,9.21,14.27,13.03,14.72,14.16,16.01,19.14,14.41,
                   15.11,14.02,15.13,7.38,17.12,16.75,19.47,
                   18.19,21.26,20.79,17.9,12.74),
              x4=c(7.36,5.99,6.11,4.35,8.79,8.53,10.02,9.79,8.79,8.53,6.15,
                   8.49,7.16,9.43,11.32,8.17,9.67,10.49,
                   9.61,13.72,11,11.19,6.94))
TrnG<-factor(rep(c(1,2,3),c(11,6,5)))

#距离判别法
source("distinguish.distance.R")
distinguish.distance(TrnX, TrnG, var.equal=TRUE) #方差相同
	      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
	blong 1 1 1 1 1 1 1 1 1  3  1  2  1  2  2  2  3  3  3  3  3  3  1
distinguish.distance(TrnX, TrnG) #方差不同
	      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
	blong 1 1 1 1 1 1 1 1 1  1  1  2  1  2  2  2  1  3  3  3  3  3  1
#贝叶斯分类器
source("distinguish.bayes.R")
distinguish.bayes(TrnX, TrnG,p=c(11/23,7/23,5/23),var.equal=T)#方差相同
	      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
	blong 1 1 1 1 1 1 1 1 1  1  1  2  1  2  2  2  1  3  2  3  3  3  1
distinguish.bayes(TrnX, TrnG,p=c(11/23,7/23,5/23))#方差不同
	      1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
	blong 1 1 1 1 1 1 1 1 1  1  1  2  1  2  2  2  1  3  3  3  3  3  1
