#8.3
X<-data.frame(x1=c(9.30,4.67,0.96,1.38,1.48,2.60,2.15,2.14,6.53,1.47,1.17,0.88,1.23,0.99,0.98,
                   0.85,1.57,1.14,1.34,0.79,1.24,0.96,0.78,0.81,0.57,1.67,1.10,1.49,1.61,1.85),
              x2=c(30.55,29.38,24.69,29.24,25.47,32.32,26.31,28.46,31.59,26.43,23.74,19.97,16.87,18.84,25.18,
                   26.55,23.16,22.57,23.04,19.14,22.53,21.65,14.65,13.85,3.85,24.36,16.85,17.76,20.27,20.66),
              x3=c(8.70,8.92,15.21,11.30,15.39,8.81,10.49,10.87,11.04,17.23,17.46,24.43,15.63,16.22,16.87,
                   16.15,15.79,12.10,10.45,10.61,13.97,16.24,24.27,25.44,44.43,17.62,27.93,27.70,22.06,12.75),
              row.names=c("北京", "天津", "河北", "山西", "内蒙古", "辽宁", "吉林", 
                          "黑龙江", "上海", "江苏", "浙江", "安徽", "福建", "江西", 
                          "山东",  "河南", "湖北", "湖南", "广东", "广西", "海南", 
                          "四川", "贵州", "云南", "西藏", "陕西", "甘肃", 
                          "青海", "宁夏", "新疆"))

#Euclide距离
Province<-dist(scale(X))
#（1）
#四种方法做聚类分析
hc1<-hclust(Province, "complete")#最长距离法
hc2<-hclust(Province, "average") #均值法
hc3<-hclust(Province, "centroid")#重心法
hc4<-hclust(Province, "ward") #Ward法

opar<-par(mfrow=c(2,1), mar=c(5.2,4,0,0))
##最长距离
plot(hc1,hang=-1)
re1<-rect.hclust(hc1,k=5,border="red")
##类平均
plot(hc2,hang=-1)
re2<-rect.hclust(hc2,k=5,border="red")
par(opar)

opar<-par(mfrow=c(2,1), mar=c(5.2,4,0,0))
##重心法
plot(hc3,hang=-1)
re3<-rect.hclust(hc3,k=5,border="red")
##离差平方和法 结果最好
plot(hc4,hang=-1)
re4<-rect.hclust(hc4,k=5,border="red")
par(opar)


#（2） 动态聚类法里面的K-mean方法
km<-kmeans(scale(X),4,nstart=20)
km
  K-means clustering with 4 clusters of sizes 18, 3, 8, 1

  Cluster means:
            x1         x2         x3
  1 -0.2304033  0.3458350 -0.3958366
  2  2.6874383  1.3003770 -0.9593090
  3 -0.4025307 -0.8758076  0.7986374
  4 -0.6948099 -3.1197000  3.6138867

  Clustering vector:
    北京   天津   河北   山西 内蒙古   辽宁   吉林 黑龙江   上海   江苏   浙江 
       2      2      1      1      1      1      1      1      2      1      1 
    安徽   福建   江西   山东   河南   湖北   湖南   广东   广西   海南   四川 
       3      3      3      1      1      1      1      1      1      1      1 
    贵州   云南   西藏   陕西   甘肃   青海   宁夏   新疆 
       3      3      4      1      3      3      3      1 

  Within cluster sum of squares by cluster:
  [1] 8.531341 3.290475 3.938115 0.000000
   (between_SS / total_SS =  81.9 %)

  Available components:

  [1] "cluster"      "centers"      "totss"        "withinss"     "tot.withinss"
  [6] "betweenss"    "size"         "iter"         "ifault"      
sort(km$cluster)
  河北   山西 内蒙古   辽宁   吉林 黑龙江   江苏   浙江   山东   河南   湖北 
     1      1      1      1      1      1      1      1      1      1      1 
  湖南   广东   广西   海南   四川   陕西   新疆   北京   天津   上海   安徽 
     1      1      1      1      1      1      1      2      2      2      3 
  福建   江西   贵州   云南   甘肃   青海   宁夏   西藏 
     3      3      3      3      3      3      3      4 