#异常值样本点
##DFFITS准则的计算函数 dffits()
##dffits(model, infl = , res = )
##例子6-16
###来自于例子6-2
x<-c(0.10,0.11,0.12,0.13,0.14,0.15,0.16,0.17,0.18,0.20,0.21,0.23)
y<-c(42.0,43.5,45.0,45.5,45.0,47.5,49.0,53.0,50.0,55.0,55.0,60.0)
lm.sol<-lm(y ~ 1+x)
summary(lm.sol)
p<-1; n<-length(x); d<-dffits(lm.sol)
cf<-1:n; cf[d>2*sqrt((p+1)/n)]
###来自于例子6-5
X<-matrix(c(
  194.5, 20.79, 1.3179, 131.79,
  194.3, 20.79, 1.3179, 131.79,
  197.9, 22.40, 1.3502, 135.02,
  198.4, 22.67, 1.3555, 135.55,
  199.4, 23.15, 1.3646, 136.46,
  199.9, 23.35, 1.3683, 136.83,
  200.9, 23.89, 1.3782, 137.82,
  201.1, 23.99, 1.3800, 138.00,
  201.4, 24.02, 1.3806, 138.06,
  201.3, 24.01, 1.3805, 138.05,
  203.6, 25.14, 1.4004, 140.04,
  204.6, 26.57, 1.4244, 142.44,
  209.5, 28.49, 1.4547, 145.47,
  208.6, 27.76, 1.4434, 144.34,
  210.7, 29.04, 1.4630, 146.30,
  211.9, 29.88, 1.4754, 147.54,
  212.2, 30.06, 1.4780, 147.80),
  ncol=4, byrow=T,
  dimnames = list(1:17, c("F", "h", "log", "log100")))

forbes<-data.frame(X)
plot(forbes$F, forbes$log100)
lm.sol2<-lm(log100~F, data=forbes)
summary(lm.sol2)
abline(lm.sol2)
p<-1; n<-nrow(forbes); d<-dffits(lm.sol2)
cf<-1:n; cf[d>2*sqrt((p+1)/n)]

source("Reg_Diag.R")
##回归诊断的总括 influence.measures
influence.measures(lm.sol2)
##高杠杆值的观测点可通过帽子统计量（hat statistic）判断
hat.plot(lm.sol2)
